src/config/Catalogs/ДоговорыЭквайринга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>ДоговорыЭквайринга</Name>
			<Comment>(Упр) Договоры об использовании банковских карточек в качестве платежного средства</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Эквайрер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТарифыЗаРасчетноеОбслуживание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОплатЧекаККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентТорговойУступки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/config/Enums/ТипыОплатЧекаККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыОплатЧекаККМ</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскийКредит</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Catalogs/ДоговорыЭквайринга/Ext/ObjectModule.bsl
// Обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)

	Если Не ОбменДанными.Загрузка Тогда
		Если НЕ ЗначениеЗаполнено(Эквайрер) Тогда
			#Если Клиент Тогда
			СообщитьПользователюНезаполненРеквизит(Ссылка, "Эквайрер");
			#КонецЕсли
			Отказ = Истина;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ДоговорВзаиморасчетов) Тогда
			#Если Клиент Тогда
			СообщитьПользователюНезаполненРеквизит(Ссылка, "ДоговорВзаиморасчетов");
			#КонецЕсли
			Отказ = Истина;
		КонецЕсли;

		Заголовок = "Справочник ""Договоры эквайринга"": ";

		СтруктураОбязательныхПолей = Новый Структура("ВидОплаты");
		ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ТарифыЗаРасчетноеОбслуживание", СтруктураОбязательныхПолей, Отказ, Заголовок);

		ПредставлениеТабличнойЧасти = Метаданные().ТабличныеЧасти["ТарифыЗаРасчетноеОбслуживание"].Представление();

		СтрокаОкончанияСообщенияОбОшибке = "Выбран вид оплаты неверного типа!";

		Для Каждого СтрокаТарифа Из ТарифыЗаРасчетноеОбслуживание Цикл
			Если СтрокаТарифа.ВидОплаты.ТипОплаты = Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта или СтрокаТарифа.ВидОплаты.ТипОплаты = Перечисления.ТипыОплатЧекаККМ.БанковскийКредит Тогда
			иначе	
				СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТарифа.НомерСтроки)
				   + """ табличной части """ + ПредставлениеТабличнойЧасти + """: ";
				СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаОкончанияСообщенияОбОшибке,
				                    Отказ, Заголовок);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()
